SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( MU_RF_BR_4F_44102
 Type ( Engine )
 WagonShape ( RF_BR_4F_44102.s )
 FreightAnim ( crew_35.s 1 1 )
 Size ( 2.6164m 4.0m 8.8m )
 CentreOfGravity ( 0.0m 0.0m 0.0m )
 Centre ( 0m 2.01671m -0.210645m )
 Mass ( 49.53t )
 InertiaTensor ( Box(2.6164m 4.0m 8.8m ) )
 Coupling (
 Type ( Bar )
 Spring (
 Stiffness ( 1e7N/m 1e7N/m )
 Damping ( 0.2e7N/m/s 0.2e7N/m/s )
 Break ( 1e7N 1e7N )
 r0 ( 10cm 1e9 )
 )
 CouplingHasRigidConnection ()
 Velocity (0.1m/s)
 CouplingUniqueType ( 4F )
 )

 Coupling (
 Type ( Chain )
 Spring (
 Stiffness ( 1e6N/m 2e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 Break ( 3.2e7N 3.2e7N )
 r0 ( 20cm 40cm )
 )
 )
 Antislip ( 1 )
Adheasion ( 0.5 0.8 0.246 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 2.5*49.53t )
 DerailBufferForce ( 800kN )
 WheelRadius ( 0.485m )
 NumWheels ( 3 )
 Friction (
 917N/m/s 0 1mph 14.69N/m/s 1.8
 5.1N/rad/s 1 -1rad/s 0 1
 ) 
 
 BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce( 30kN )
 MaxHandbrakeForce( 50kN )
 NumberOfHandbrakeLeverSteps( 100 )
 MaxReleaseRate( 10 )
 MaxApplicationRate( 10 )
 MaxAuxilaryChargingRate( 10 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )
 
 
 
 Sound ( "..\\..\\common.sound\\2cyl_generic\\#AI-2cyl-60-120-01.sms" )

 Lights ( 15
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffff70 )
 Position ( 0 3.135 3.782 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 0.4 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffff70 )
 Position ( -1.025 1.516 3.852 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 0.4 )
 )
 )
 )

 Light (
 
 Type ( 1 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffe610 )
 Position ( 0 10.0 -12.0 )
 Transition ( 0 )
 Radius ( 6.0 )
 Angle ( 90.0 )
 )
 )
 )
 Light (
 
 Type ( 1 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffe610 )
 Position ( 0 10.0 -13.50 )
 Transition ( 0 )
 Radius ( 6.0 )
 Angle ( 90.0 )
 )
 )
 )
 
Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.5 )
 LightColour ( eeff8800 )
 Position ( 0 2.06 -3.29 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 )
 State (
 Duration ( 0.3 )
 LightColour ( eeff8800 )
 Position ( 0 2.06 -3.29 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 
 )
 
 )
 )
 Light ( 
 comment( Ashpan flashes ) 
 Type ( 0 ) 
 Conditions ( 
 Headlight ( 3 ) 
 Unit ( 0 ) 
 ) 
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 1 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 01.4 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.4 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 3 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 5 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.25 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.0 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 )
 )
 )
 Light ( 
 comment( Chimney Sparks RS1AA ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.42 2.8 )

 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.72 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.52 2.8 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.72 2.8 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.92 2.8 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.32 2.8 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.52 2.8 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.92 2.8 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.226 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.35 2.8 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.55 2.8 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.25 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.8 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.22 2.8 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.8 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.8 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0 5.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.8 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.225 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 5.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.8 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.8 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.233 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 9.22 2.8 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 )
 )
 )

 Light ( 
 comment( Chimney Sparks RS1AA ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )

 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 7.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.234 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.7 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.234 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.7 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.2235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 8.22 2.7 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0 9.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.72 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.72 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.72 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.72 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.72 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.72 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 )
 )
 )

 Light ( 
 comment( Chimney Sparks AA1 ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.0 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.0 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 8.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 8.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 8.5 2.7 ) 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 3 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 8.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 8.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 )
 Position ( 0.0 6.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 8.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.0 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 )
 )
 )

 Light ( 
 comment( Chimney Sparks AA ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 3 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 )
 Position ( 0.0 5.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 7.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 7.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 4.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 4.50 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front )
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 0.975 )
 FadeOut ( 0.975 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.645 -1.8 )
 Azimuth ( -90 -90 -90 )
 Transition ( 0 )
 Radius ( 1.3 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.62 -1.8 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front )
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 2 )
 )
 FadeIn ( 0.75 )
 FadeOut ( 0.75 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.655 -1.8 )
 Azimuth ( 45 45 45 )
 Transition ( 0 )
 Radius ( 1.35 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.655 -1.8 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.35 )
 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front )
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 1.95 )
 FadeOut ( 1.95 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.655 -1.8 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.34 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.655 -1.8 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.34 )
 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front Leading )
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 2 )
 )
 FadeIn ( 1.5 )
 FadeOut ( 1.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0.0 0.652 -1.8 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 1.34 )
 Elevation ( -10 -10 -10 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0.0 0.652 -1.8 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 1.34 )
 Elevation ( -10 -10 -10 )
 )
 )
 )

 Light (
 comment( Flickering Ashpan Back )
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.643 -2.25 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.643 -2.25 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1 )
 
 )
 )
 )

 )

 )

Engine ( MU_RF_BR_4F_44102 
 Effects (
 SteamSpecialEffects
 (
 StackFX
 (
 0 4.10 2.816
 0 2 0
 .5
 )
 SafetyValvesFX
 (
 0 3.822 -2.508
 0 2 0
 .3
 )
 WhistleFX
 (
 0 4.021 -2.906
 0 1 0
 .3
 )
 CylindersFX
 (
 -0.637 1.0 2.07
 0 0 1
 .2
 )
 CylindersFX
 (
 0.637 1.0 2.07
 0 0 1
 .2
 )
 )
 )

 Wagon ( MU_RF_BR_4F_44102 )
 IsTenderRequired( 1 ) 
 Type ( Steam )
 MaxPower ( 925kW )
 MaxForce ( 24556lbf )
 MaxVelocity ( 55mph )
 WheelRadius ( 0.800m )
 Sanding ( 1e9mph )
 NumWheels ( 1 )
 BoilerLength ( 3.35m )
 BoilerVolume ( "191*(ft^3)" )
 BoilerEffectivity ( 1.2 )
 DraftingEffect ( 0.95 )
 BoilerResponsiveness ( 1.1 )
 CoalBurnage ( 4.3lb/hp/h )
 MaxBoilerOutput ( 16058lb/h )
 NumCylinders ( 2 )
 CylinderStroke ( 26in )
 CylinderDiameter ( 20in )
 CylinderVolume ( "18.92*(ft^3)" )
 CylinderEffectivity ( 1.4 )
 InjectorSizes ( 11mm 12mm )
 ExhaustLimit ( 17664lb/h )
 PrimingFactor ( 0.95 )
 BlastExponent ( 0.60 )
 MaxBoilerPressure ( 175psi )
 MaxFireMass ( 1496lb )
 IdealFireMass ( 1092lb )
 MaxWaterMass ( 4000lb ) 
 SafetyValvesSteamUsage ( 5839lb/h )
 ShovelCoalMass ( 10lb )
 SmokeCombustion ( 1 )
 MaxTenderCoalMass ( 8960lb )
 MaxTenderWaterMass ( 35000lb )

 comment(0 for live steam, 1 for exhaust steam)
 InjectorTypes( 0 1 ) 
 SuperHeater ( 1.22 )
 SteamSmokeUnitsPerPoundOfFuel( 1 )
 SteamMaxSmokeUnitsReleaseRate( 1 )
 MaxSteamHeatingPressure( 20 )
 SafetyValvePressureDifference( 7 )
 SteamGaugeGlassHeight( 10 )
 BasicSteamUsage ( 20lb/h )
 BasicCoalUsage ( 110lb/h )

 comment( min steam pressure, min water proportion, max water proportion )
 InjectorLimits1 ( 50psi 0.6 1 )
 InjectorLimits2 ( 60psi 0 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

 VacuumBrakesSmallEjectorPowerRating( 3.5 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 250 )
 VacuumBrakesLargeEjectorUsageRate( 1000 )
 VacuumBrakesHasVacuumPump( 1 )

 TrainBrakesControllerMaxReleaseRate( 12 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )

 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )

 BrakesEngineBrakeType ( "Vacuum_single_pipe" )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Hand, Train" )

 SteamSmallestCutoff( 8 )
 NumberOfDamperSteps( 4 )

 RegulatorValveType ( Twin_port )
 RegulatorSecondValveStartPosition( 0.5 )
 RegulatorPilotValveExponent( 1.7 )
 RegulatorSecondValveExponent( 1.7 )
 RegulatorPilotValveFullOpenning( 0.3 )
 RegulatorMainValveInitialOpenning( 0.4 )

 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.15 )

 
 
 
 
 
 
 SteamSmokeUnitsPerPoundOfFuel( 3.3 )

 
 

 EngineControllers (
 comment( Engine controls )
 
 Regulator ( 0 1 0.025 0 
 NumNotches( 0 )
 )

 Cutoff ( -0.75 0.75 0.0075 0 
 NumNotches( 15
 Notch ( -0.75 0 Dummy )
 Notch ( -0.65 0 Dummy )
 Notch ( -0.55 0 Dummy )
 Notch ( -0.45 0 Dummy )
 Notch ( -0.35 0 Dummy )
 Notch ( -0.25 0 Dummy )
 Notch ( -0.15 0 Dummy )
 Notch ( 0.0 0 Dummy )
 Notch ( 0.15 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.35 0 Dummy )
 Notch ( 0.45 0 Dummy )
 Notch ( 0.55 0 Dummy )
 Notch ( 0.65 0 Dummy )
 Notch ( 0.75 0 Dummy )
 
 )
 )
 
 Brake_Train ( 0 1 0.0375 0.65
 NumNotches( 3
 Notch( 0 1 TrainBrakesControllerReleaseStart )
 Notch(0.01 1 TrainBrakesControllerRunningStart )
 Notch(0.2 1 TrainBrakesControllerApplyStart )
 )
 )
 Brake_Hand ( 0 1 0.0125 0 
 NumNotches( 0 )
 )
 FireDoor ( 0 1 0.075 1 
 NumNotches( 0 )
 )
 Sanding( 0 1 0 )
 Blower ( 0 1 0.025 0.02 
 NumNotches( 0 )
 )
 HeatingTap ( 0 1 0.035 0 
 NumNotches( 5 
 Notch ( 0 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 
 )
 )
 Shovel ( 0 1 1 0 
 NumNotches( 5
 Notch ( 0 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 Notch ( 2 0 Dummy )
 
 )
 )
 
 DampersFront ( 0 1 0.1 0.15 
 NumNotches ( 6 
 Notch ( 0 0 Dummy )
 Notch ( 0.15 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )


 
 )
 )
 Injector1Steam ( 0 1 0 )
 Injector2Steam ( 0 1 0 )
 Injector1Water ( 0 1 0.1 0 
 NumNotches( 5 
 Notch ( 0 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )

 )
 )
 
 Injector2Water ( 0 1 0.1 0 
 NumNotches( 5 
 Notch ( 0 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 
 )
 )

 CylinderCocks ( 0 1 1 )
 Whistle ( 0 1 0 )
 WaterScoop ( 0 1 0 )
 SmallEjectorOrCompressor( 0 1 0 )
 Headlights( 0 1 0 )
 )

 comment(fire temp, fire mass, water mass, boiler pressure,
 water level, tender_water_mass, tender_coal_mass,
 smoke_quantity, fire_condition, coal quality )
 
 EngineVariables( 900 1092 3000 166 1.0 35000 1.0 1 1.0 0.85 )
 
 Name ( "MU_BR 4F 44102" )
 Description (
 ""

 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+ 
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)
